<template>
  <h2 class="block-title">FAQ</h2>

  <div class="faq-container">

    <details class="my-details"> <!-- вставить details -->

      <ol>
        <li class="faq-p-title">
          <summary>
            <div>
              <!--<h4 class="faq-p-title"> 1.</h4> -->
              <span class="faq-title">
                Кто непосредственно занимется поддержкой?
              </span>
            </div></summary>
        </li>
      </ol>

      <div class="faq-content">
        Сайты поддерживают штатные сотрудники ООО «Инитлаб», г.
        Краснодар, прошедшие специальное обучение и имеющие опыт
        работы с Друпал от 4 до 15 лет: 8 web-разработчиков, 2
        специалиста по SEO, 4 системных администратора.
      </div>
    </details>

    <details> <!-- вставить details -->
      <summary>
        <li class="faq-p-title">
          <div>
            <!--<h4 class="faq-p-title"> 1.</h4> -->
            <span class="faq-title"> Как организована работа поддержки?</span>
          </div>
        </li>
      </summary>
      <div class="faq-content">
        Клиент выбирает один из тарифов и делает предоплату. Все заявки на работы по сайту
        заводятся в нашу систему Service desk. В течение времени реакции по тарифу закрепленный за проектом специалист
        приступает к выполнению заявки, фиксирует время, потраченное на выполнение заявки и закрывает заявку по
        окончанию работы. Клиент может посмотреть все заявки в работе и отработанные часы
        в своем кабинете через веб-интерфейс.
      </div>
    </details>

    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          Что происходит, когда отработаны все предоплаченные часы за месяц?
        </span>
      </summary>
      <div class="faq-content">
        Мы уведомляем Клиента, о том, что последующие заявки в этом месяце будут выполняться с
        доплатой согласно тарифу либо будут перенесены по срокам на следующий месяц. В конце
        месяца, в котором были заявки с доплатой, клиентам отправляется счет на доплату по
        факту выполненных работ сверх предоплаты тарифного плана.
      </div>
    </details>

    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          Что происходит, когда не отработаны все предоплаченные часы за месяц?
        </span>
      </summary>
      <div class="faq-content">
        Предоплата не переносится на следующий месяц и деньги не возвращаются. Для продолжения
        поддержки сайта необходимо оплатить предоплату согласно выбранному тарифу за следующий месяц.
      </div>
    </details>

    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          Как происходит оценка и согласование планируемого времени на выполнение
          заявок?
        </span>
      </summary>
      <div class="faq-content">
        Заявки, выполнение которых укладывается в оставшееся предоплаченное время, по умолчанию
        не оцениваются и время не согласовывается, мы стараемся сэкономить время и быстро выполнить работу. Если видим,
        что задача не укладывается в предоплаченное время, то делаем примерную оценку по времени и согласовываем оценку
        трудоемкости с Клиентом. Клиент может явно попросить предварительно оценить работу по времени и согласовать
        трудоемкость, направив заявку с припиской в теме письма «Оценить работу». В этом случае время на оценку также
        оплачивается согласно тарифу поддержки. Если время фактического выполнения превышает заранее согласованное, то
        уточняем оценку, договариваемся о возможной доплате и переносе сроков по задаче. На наше усмотрение большие
        задачи, трудоемкость которых мы можем заранее оценить, например, разработка отдельных модулей или
        самостоятельных разделов сайта по подробному техническому заданию, могут быть вынесены из поддержки в отдельный
        проект на договорных условиях.
      </div>
    </details>

    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          Сколько программистов выделяется на проект?
        </span>
      </summary>
      <div class="faq-content">
        1-2 человека. За каждым проектом закрепляется один ответственный специалист, через
        которого проходят все заявки. Все заявки становятся в очередь к ответственному в порядке их поступления в
        Helpdesk. Возможно привлечение дополнительных штатных специалистов в поддержку проекта в случаях, когда:

      </div>
    </details>
    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          Как подать заявку на внесение изменений на сайте?
        </span>
      </summary>
      <div class="faq-content">
        Для подачи заявки на внесение изменений на сайте необходимо написать письмо на email
        поддержки с указанием в теме письма домена сайта и подробным описанием вносимых изменений.
      </div>
    </details>
    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          Как подать заявку на добавление пользователя, изменение настроек веб-сервера и других задач по администрированию?         </span>
      </summary>
      <div class="faq-content">
        Для любых задач по администрированию необходимо написать письмо на email поддержки с
        указанием домена сайта и описанием задачи.
      </div>
    </details>
    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          В течение какого времени начинается работа по заявке?         </span>
      </summary>
      <div class="faq-content">
        Время реакции зависит типа заявки и от выбранного тарифного плана. Время реакции на сбои,
        обнаруживаемые системой мониторинга, от 2-х часов в рабочее время. Время реакции на заявки по доработке сайта
        от 24-х часов в рабочее время. Время реакции может быть более гибко определено в SLA.
      </div>
    </details>
    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          В какое время работает поддержка?
        </span>
      </summary>
      <div class="faq-content">
        Время работы поддержки с 10 до 18 часов (MSK, GMT+3) в рабочие дни. Мы также можем выполнять работы сверхурочно
        по договоренности с оплатой по двойной ставке часа.
      </div>
    </details>
    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          Подходят ли услуги поддержки, если необходимо произвести обновление ядра Drupal или модулей?
        </span>
      </summary>
      <div class="faq-content">
        Обновление безопасности в рамках одной ветки Drupal делается в режиме поддержки на всех
        тарифных планах. Обновление, связанное с переходом на следующую ветку Drupal, например апгрейд с 6.х на 7.х,
        лучше делать в рамках отдельного проекта, стоимость и сроки которого мы можем предложить после проведения
        аудита апгрейда. Аудит апгрейда включает в себя анализ путей миграции и трудоемкости обновления для всех
        модулей, блоков кода, Views, тем оформления, стоит от 6500 рублей и, как правило, занимает 1-3 дня, в
        зависимости от размера сайта.
      </div>
    </details>
    <details> <!-- вставить details -->
      <summary>
        <span class="faq-title">
          Можно ли пообщаться со специалистом голосом или в мессенджере?
        </span>
      </summary>
      <div class="faq-content">
        Для этого нужно написать заявку на консультацию на email поддержки и сообщить удобное время и контактные данные.
      </div>
    </details>


  </div>




</template>

<script>

</script>

<style>

.my-details {transition:  .75s}

.block-title{
  font-size: 24px;
  margin-bottom: 50px;
  margin-top: 50px;
  text-align: center;
  color: #050c33;
  font-weight: 700;
}

.faq-container{
  display: flex;
  flex-direction: column;
  gap: 16px;
  margin-top: 10px;
  margin-right: auto;
  margin-left: auto;
  padding-left: 15px;
  padding-right: 15px;
}

summary{
  user-select: none;
  cursor: pointer;
  font-weight: 600;
  display: flex;
  list-style: none;
  padding: 1em;
  align-items: center;

}

details{
  font-size: 1rem;
  margin: 0 auto;
  width: 100%;
  background: white;
  border-radius: 1px;

  max-width: 800px;
  border: 1px solid #ffff;
  transition: all 0.3s ease-in-out;
}
details:hover{
  border: 3px solid #e04331;
}
summary:hover .faq-title{
  opacity: 1;
}
summary::-webkit-details-marker{
  display: none;
}
summary:focus{outline: none}

.faq-title{
  color:#050c33;
  width: 90%;
  transition: all 250ms ease-in-out;
  font-size: 16px;
}
li{
  color:#4e5a73;
  font-size: 12px;
}

.faq-title:hover{
  color: #e04331;
}

.faq-content{
  padding: 0.2em 1em 1em 1em;
  font-weight: 300;
  line-height: 1.2;
  color: #4e5a73;

}


.faq-title h4 {
  margin: 0;
  font-size: 18px;
  font-weight: bold;
}
</style>